# Simulador de Red LAN - Proyecto 2 Algoritmos

Un simulador completo de red de √°rea local (LAN) implementado en Python, con una interfaz de l√≠nea de comandos (CLI) inspirada en Cisco IOS. El proyecto implementa estructuras de datos avanzadas desde cero y proporciona una experiencia realista de configuraci√≥n y administraci√≥n de redes.

## üöÄ Caracter√≠sticas Principales

### üìä Estructuras de Datos Implementadas
- **Lista Enlazada**: Para almacenamiento din√°mico de vecinos y conexiones
- **Cola (Queue)**: Para gesti√≥n de paquetes entrantes/salientes
- **Pila (Stack)**: Para historial de paquetes recibidos
- **√Årbol AVL**: Para tabla de rutas balanceada con O(log n) garantizado
- **B-Tree**: Para √≠ndice persistente de snapshots de configuraci√≥n
- **Trie N-ario**: Para prefijos IP y pol√≠ticas jer√°rquicas

### üñ•Ô∏è Dispositivos Soportados
- **Routers**: Enrutamiento completo con tabla de rutas AVL
- **Switches**: Conmutaci√≥n a nivel 2
- **Hosts**: Dispositivos finales (computadoras)
- **Firewalls**: Con capacidades de filtrado (futuro)

### üîß Funcionalidades CLI
- **Modos m√∫ltiples**: Usuario, Privilegiado, Configuraci√≥n Global, Configuraci√≥n de Interfaz
- **Comandos completos**: Inspirados en Cisco IOS
- **Sistema de ayuda**: Ayuda contextual en cada modo
- **Validaci√≥n de sintaxis**: Detecci√≥n y reporte de errores

## üìÅ Estructura del Proyecto

```
proyecto2algoritmos/
‚îú‚îÄ‚îÄ main.py                 # Archivo principal del simulador
‚îú‚îÄ‚îÄ test_structures.py      # Pruebas de estructuras de datos
‚îú‚îÄ‚îÄ simple_test.py         # Pruebas b√°sicas
‚îú‚îÄ‚îÄ data_structures/       # Implementaciones de estructuras
‚îÇ   ‚îú‚îÄ‚îÄ __init__.py
‚îÇ   ‚îú‚îÄ‚îÄ linked_list.py     # Lista enlazada
‚îÇ   ‚îú‚îÄ‚îÄ queue.py          # Cola FIFO
‚îÇ   ‚îú‚îÄ‚îÄ stack.py          # Pila LIFO
‚îÇ   ‚îú‚îÄ‚îÄ avl_tree.py       # √Årbol AVL para rutas
‚îÇ   ‚îú‚îÄ‚îÄ b_tree.py         # B-Tree para √≠ndices
‚îÇ   ‚îî‚îÄ‚îÄ trie.py           # Trie para prefijos IP
‚îú‚îÄ‚îÄ network/              # L√≥gica de red
‚îÇ   ‚îú‚îÄ‚îÄ __init__.py
‚îÇ   ‚îú‚îÄ‚îÄ device.py         # Clase Device e Interface
‚îÇ   ‚îú‚îÄ‚îÄ network.py        # Clase Network
‚îÇ   ‚îî‚îÄ‚îÄ packet.py         # Clase Packet
‚îú‚îÄ‚îÄ cli/                  # Interfaz de comandos
‚îÇ   ‚îú‚îÄ‚îÄ __init__.py
‚îÇ   ‚îî‚îÄ‚îÄ cli_parser.py     # Parser CLI con modos
‚îî‚îÄ‚îÄ utils/                # Utilidades
    ‚îú‚îÄ‚îÄ __init__.py
    ‚îî‚îÄ‚îÄ error_logger.py   # Sistema de logging de errores
```

## üéØ Uso del Simulador

### Inicio R√°pido

```bash
# Ejecutar el simulador
python main.py
```

Al iniciar, el simulador crea autom√°ticamente:
- **Router1** con IP 192.168.1.1
- **Switch1** (switch b√°sico)
- **PC1** con IP 192.168.1.10
- **PC2** con IP 192.168.1.20
- **Conexiones**: Router1 ‚Üî PC1, Router1 ‚Üî PC2
- **Rutas pre-configuradas** en Router1:
  - 10.0.0.0/24 via 192.168.1.100 metric 10
  - 172.16.0.0/16 via 192.168.1.200 metric 5
  - 192.168.2.0/24 via 192.168.1.50 metric 15
  - 0.0.0.0/0 via 192.168.1.254 metric 100 (default)

### Comandos B√°sicos

#### Modo Usuario
```
Router1> enable              # Entrar a modo privilegiado
Router1> ping 192.168.1.10   # Enviar ping
Router1> send 192.168.1.1 192.168.1.10 "Hola"  # Enviar mensaje
Router1> help                # Ver ayuda
Router1> exit                # Salir
```

#### Modo Privilegiado
```
Router1# configure terminal           # Entrar a configuraci√≥n
Router1# show history                 # Ver historial de paquetes
Router1# show statistics              # Ver estad√≠sticas de red
Router1# show error-log               # Ver registro de errores
Router1# show ip route                # Ver tabla de rutas
Router1# show route avl-stats         # Ver estad√≠sticas del AVL
Router1# show ip route-tree           # Ver √°rbol AVL visualmente
Router1# connect g0/0 PC1 eth0        # Conectar interfaces
Router1# list_devices                 # Listar dispositivos
Router1# tick                         # Avanzar simulaci√≥n
Router1# disable                      # Volver a modo usuario
```

#### Modo Configuraci√≥n
```
Router1(config)# hostname RouterCentral   # Cambiar nombre
Router1(config)# interface g0/1          # Configurar interfaz
Router1(config)# ip route add 10.0.0.0 255.255.255.0 via 192.168.1.2  # Agregar ruta
Router1(config)# policy set 192.168.1.0 255.255.255.0 block  # Establecer pol√≠tica
Router1(config)# exit                     # Volver a privilegiado
Router1(config)# end                      # Volver a privilegiado
```

#### C√≥mo Entrar a Cada Modo

**Para llegar al modo Configuraci√≥n de Interfaz, sigue estos pasos:**

```bash
# Paso 1: Modo Usuario ‚Üí Modo Privilegiado
Router1> enable
Router1#

# Paso 2: Modo Privilegiado ‚Üí Modo Configuraci√≥n
Router1# configure terminal
Router1(config)#

# Paso 3: Modo Configuraci√≥n ‚Üí Modo Configuraci√≥n de Interfaz
Router1(config)# interface g0/0
Router1(config-if)#
```

#### Modo Configuraci√≥n de Interfaz
```
Router1(config-if)# ip address 10.0.0.1 255.255.255.0  # Configurar IP
Router1(config-if)# no shutdown             # Activar interfaz
Router1(config-if)# shutdown                # Desactivar interfaz
Router1(config-if)# exit                    # Volver a configuraci√≥n
Router1(config-if)# end                     # Volver a privilegiado
```

**Interfaces disponibles en Router1:**
- `g0/0` - Interfaz principal (ya configurada con IP 192.168.1.1)
- `g0/1` - Interfaz adicional (sin configurar por defecto)

## üîç Estructuras de Datos Detalladas

### Lista Enlazada
```python
from data_structures import LinkedList

ll = LinkedList()
ll.append("A")
ll.append("B")
ll.prepend("Z")  # Z -> A -> B
print(ll)  # [Z -> A -> B]
```

### Cola (Queue)
```python
from data_structures import Queue

q = Queue()
q.enqueue("primero")
q.enqueue("segundo")
print(q.dequeue())  # "primero"
```

### Pila (Stack)
```python
from data_structures import Stack

s = Stack()
s.push("primero")
s.push("segundo")
print(s.pop())  # "segundo"
```

### √Årbol AVL
```python
from data_structures import AVLTree

avl = AVLTree()
avl.insert_key("10.0.0.0/24", {"next_hop": "192.168.1.2", "metric": 10})
print(avl.get_stats())  # {"nodes": 1, "height": 1, "rotations": {...}}
```

### B-Tree
```python
from data_structures import BTree

bt = BTree(order=4)
bt.insert("snapshot_001", "config1.txt")
bt.insert("lab_grupoA", "lab_config.txt")
print(bt.get_stats())  # {"order": 4, "height": 1, "nodes": 1, ...}
```

### Trie N-ario
```python
from data_structures import Trie

trie = Trie()
trie.insert("192.168.1.0", "255.255.255.0", {"block": True})
prefix, policy = trie.search_longest_prefix("192.168.1.10")
print(f"{prefix} -> {policy}")  # "192.168.1.0/24 -> {'block': True}"
```

### Pol√≠ticas de Red con Trie
```python
# El trie se integra autom√°ticamente en el dispositivo
device = network.get_device("Router1")

# Pol√≠ticas se aplican autom√°ticamente antes del reenv√≠o
route = device.find_route("192.168.1.10")  # Consulta trie primero

# Si hay pol√≠tica de bloqueo, retorna None
# Si hay pol√≠tica ttl-min, se verifica antes de enviar
```

### B-Tree para Snapshots
```python
from data_structures import BTree

# El B-tree se usa internamente en la clase Network
btree = BTree(order=4)  # Orden 4 (m√°ximo 4 hijos por nodo)
btree.insert("laboratorio", "snapshots/laboratorio.cfg")
btree.insert("2025-08-12T09:30", "snapshots/2025-08-12T09:30.cfg")

# Recorrer todos los snapshots en orden
for key, filename in btree.get_all_entries():
    print(f"{key} -> {filename}")

# Obtener estad√≠sticas
stats = btree.get_stats()
print(f"Orden: {stats['order']}, Altura: {stats['height']}")
print(f"Splits: {stats['splits']}, Merges: {stats['merges']}")
```

## üìà Estad√≠sticas y Monitoreo

### Estad√≠sticas de Red
```
Router1# show statistics
Total packets sent: 15
Total packets received: 13
Packets dropped: 2
Average hops: 2.1
Top talker: Router1 (processed 20 packets)
Devices online: 4/4
```

### Estad√≠sticas de Rutas AVL
```
Router1# show route avl-stats
nodes=4 height=3 rotations: LL=1 LR=0 RL=0 RR=1
```

### Visualizaci√≥n del √Årbol AVL
```
Router1# show ip route-tree
=== √ÅRBOL AVL DE RUTAS ===
            [172.16.0.0/16]
        /                       \
[10.0.0.0/24]                [192.168.2.0/24]
                            /                \
                [192.168.1.0/24]        [0.0.0.0/0]
==============================

### Estad√≠sticas de Estructuras
```python
# Estad√≠sticas AVL
stats = device.routing_table.get_stats()
print(f"Nodos: {stats['nodes']}, Altura: {stats['height']}")
print(f"Rotaciones: LL={stats['rotations']['LL']}, LR={stats['rotations']['LR']}")

# Estad√≠sticas B-Tree de snapshots
stats = network.snapshots.get_stats()
print(f"Orden: {stats['order']}, Altura: {stats['height']}")
print(f"Splits: {stats['splits']}, Merges: {stats['merges']}")
```

### Gesti√≥n de Snapshots con B-Tree
```
Router1# save snapshot laboratorio
Snapshot 'laboratorio' guardado en snapshots/laboratorio.cfg

Router1# show snapshots
laboratorio -> snapshots/laboratorio.cfg

Router1# show btree stats
order=4 height=1 nodes=1 splits=0 merges=0

Router1# load config laboratorio
Configuration loaded successfully.
Devices and connections restored.
```

## üíæ Persistencia de Configuraci√≥n

### Guardar Configuraci√≥n
```
Router1# save running-config          # Guardar como running-config.txt
Router1# save snapshot laboratorio    # Guardar snapshot nombrado
```

### Cargar Configuraci√≥n
```
Router1# load config laboratorio      # Cargar snapshot
Configuration loaded successfully.
Devices and connections restored.
```

### Formato de Archivo de Configuraci√≥n
```
hostname Router1
interface g0/0
  ip address 192.168.1.1
  no shutdown
exit
interface g0/1
  ip address 10.0.0.1
exit

hostname PC1
interface eth0
  ip address 192.168.1.10
exit

connect Router1 g0/0 PC1 eth0
connect Router1 g0/1 PC2 eth0

ip route add 10.0.0.0 255.255.255.0 via 192.168.1.2 metric 10
policy set 192.168.1.0 255.255.255.0 ttl-min 5
```

## üêõ Sistema de Registro de Errores

### Ver Errores
```
Router1# show error-log        # Ver todos los errores
Router1# show error-log 5      # Ver √∫ltimos 5 errores
```

### Tipos de Errores Registrados
- **SyntaxError**: Errores de sintaxis en comandos
- **ConnectionError**: Errores de conexi√≥n entre dispositivos
- **CommandDisabled**: Comando no disponible en modo actual
- **NetworkError**: Errores de red (IP no encontrada, etc.)
- **PolicyViolation**: Paquetes descartados por violar pol√≠ticas
- **NoRouteToHost**: No se encontr√≥ ruta para el destino
- **TTLExpired**: TTL expir√≥ durante el tr√°nsito
- **SystemError**: Errores del sistema

### Flujo de Procesamiento con Logging
```
Paquete llega ‚Üí Lookup en Trie de pol√≠ticas
    ‚Üì
Si viola pol√≠tica ‚Üí Descartar + Log PolicyViolation
    ‚Üì
Si pasa ‚Üí Lookup en tabla AVL
    ‚Üì
Si no hay ruta ‚Üí Descartar + Log NoRouteToHost
    ‚Üì
Si hay ruta ‚Üí Validar con ARP
    ‚Üì
Enviar paquete ‚Üí Decrementar TTL
    ‚Üì
Si TTL ‚â§ 0 ‚Üí Descartar + Log TTLExpired
```

## üéØ Ejemplos de Uso Completo

### Sesi√≥n Completa con Rutas Pre-configuradas
```
=== Simulador de Red LAN ===
Inspirado en Cisco IOS

Dispositivos inicializados:
- Router1 (router) con IP 192.168.1.1
- PC1 (host) con IP 192.168.1.10
- PC2 (host) con IP 192.168.1.20

Rutas configuradas en Router1:
- 10.0.0.0/24 via 192.168.1.100 metric 10
- 172.16.0.0/16 via 192.168.1.200 metric 5
- 192.168.2.0/24 via 192.168.1.50 metric 15
- 0.0.0.0/0 via 192.168.1.254 metric 100 (default)

Router1> enable
Router1# show ip route
10.0.0.0/24 via 192.168.1.100 metric 10
172.16.0.0/16 via 192.168.1.200 metric 5
192.168.2.0/24 via 192.168.1.50 metric 15
0.0.0.0/0 via 192.168.1.254 metric 100
Default: none

Router1# show route avl-stats
nodes=4 height=3 rotations: LL=1 LR=0 RL=0 RR=1

Router1# show ip route-tree
=== √ÅRBOL AVL DE RUTAS ===
            [172.16.0.0/16]
        /                       \
[10.0.0.0/24]                [192.168.2.0/24]
                            /                \
                [192.168.1.0/24]        [0.0.0.0/0]
==============================

Router1# ping 192.168.1.10
Ping enviado a 192.168.1.10

Router1# show statistics
Total packets sent: 1
Total packets received: 0
Packets dropped: 0
Average hops: 0.0
Top talker: Router1 (processed 1 packets)
Devices online: 3/3
```

### Configuraci√≥n B√°sica de Red
```
Router1> enable
Router1# configure terminal
Router1(config)# hostname RouterCentral
Router1(config)# interface g0/0
Router1(config-if)# ip address 192.168.1.1 255.255.255.0
Router1(config-if)# no shutdown
Router1(config-if)# exit
Router1(config)# exit
Router1# show statistics
```

### Env√≠o de Paquetes
```
Router1# send 192.168.1.1 192.168.1.10 "Hola desde Router1"
Message queued for delivery.

Router1# tick
[Tick] Router1 ‚Üí PC1: packet received (TTL=63)

PC1# show history
1) From 192.168.1.1 to 192.168.1.10: "Hola desde Router1" | TTL at arrival: 63 | Path: Router1 ‚Üí PC1
```

### Visualizaci√≥n de Rutas Pre-configuradas
```
Router1# show ip route
10.0.0.0/24 via 192.168.1.100 metric 10
172.16.0.0/16 via 192.168.1.200 metric 5
192.168.2.0/24 via 192.168.1.50 metric 15
0.0.0.0/0 via 192.168.1.254 metric 100
Default: none
```

### Estad√≠sticas del √Årbol AVL
```
Router1# show route avl-stats
nodes=4 height=3 rotations: LL=1 LR=0 RL=0 RR=1
```

### Configuraci√≥n de Rutas Adicionales
```
Router1(config)# ip route add 10.0.0.0 255.255.255.0 via 192.168.1.2 metric 10
Router1(config)# ip route add 172.16.0.0 255.255.0.0 via 192.168.1.3 metric 5
Router1(config)# ip route del 192.168.2.0 255.255.255.0
```

### Configuraci√≥n de Pol√≠ticas con Trie
```
Router1(config)# policy set 192.168.1.0 255.255.255.0 block
Pol√≠tica establecida

Router1(config)# policy set 10.0.0.0 255.255.0.0 ttl-min 5
Pol√≠tica establecida

Router1# show ip prefix-tree
=== TRIE DE PREFIJOS IP ===
192.168.1.0/24 {'block': True}
‚îú‚îÄ‚îÄ 10.0.0.0/16 {'ttl-min': 5}
==============================

Router1(config)# policy unset 192.168.1.0 255.255.255.0
Pol√≠tica removida
```

### Gesti√≥n de Snapshots con B-Tree
```
Router1# save snapshot laboratorio
Snapshot 'laboratorio' guardado en snapshots/laboratorio.cfg

Router1# save snapshot 2025-08-12T09:30
Snapshot '2025-08-12T09:30' guardado en snapshots/2025-08-12T09:30.cfg

Router1# show snapshots
laboratorio -> snapshots/laboratorio.cfg
2025-08-12T09:30 -> snapshots/2025-08-12T09:30.cfg

Router1# show btree stats
order=4 height=1 nodes=2 splits=0 merges=0

Router1# load config laboratorio
Configuration loaded successfully.
Devices and connections restored.
```

### Pol√≠ticas de Red
```
Router1(config)# policy set 192.168.2.0 255.255.255.0 block
Router1(config)# policy set 10.0.0.0 255.255.0.0 ttl-min 5
Router1# show ip prefix-tree
192.168.2.0/24 {block}
‚îî‚îÄ‚îÄ 10.0.0.0/16 {ttl-min=5}
```

## üîß Requisitos del Sistema

- **Python**: 3.6+
- **SO**: Windows, Linux, macOS
- **Memoria**: 128MB m√≠nimo
- **Espacio**: 10MB para configuraciones y logs

## üìù Notas de Implementaci√≥n

### Configuraci√≥n Autom√°tica
- **Rutas pre-configuradas**: 4 rutas de ejemplo se configuran autom√°ticamente al iniciar
- **Topolog√≠a b√°sica**: Router1 conectado a PC1 y PC2 con IPs realistas
- **Demostraci√≥n inmediata**: Todos los comandos de rutas funcionan sin configuraci√≥n adicional

### √çndice Persistente con B-Tree
- **Snapshots de configuraci√≥n**: Cada `save snapshot` crea un archivo y lo indexa en B-tree
- **Claves flexibles**: Soporta timestamps (2025-08-12T09:30) o nombres ("lab-grupoA")
- **B√∫squeda O(log n)**: Inserciones y b√∫squedas eficientes incluso con muchos snapshots
- **Persistencia en disco**: Los archivos se guardan en directorio `snapshots/`
- **Recorrido ordenado**: `show snapshots` muestra todos los snapshots en orden

### √Årboles Balanceados
- **AVL**: Garantiza O(log n) para inserci√≥n, b√∫squeda y eliminaci√≥n
- **B-Tree**: Optimizado para almacenamiento en disco con operaciones split/merge
- **Trie**: Eficiente para longest-prefix matching

### Complejidad Algor√≠tmica
- **Inserci√≥n/B√∫squeda AVL**: O(log n)
- **Inserci√≥n/B√∫squeda B-Tree**: O(log n) con operaciones split/merge
- **Longest Prefix Match Trie**: O(longitud_prefijo)
- **Procesamiento de colas**: O(1) por operaci√≥n

### Limitaciones
- Simulaci√≥n simplificada (no hay colisiones reales de red)
- IPv4 √∫nicamente
- No hay soporte completo para protocolos de red reales
- Memoria limitada para entornos de producci√≥n
- Rutas pre-configuradas son ejemplos (no rutas "reales")
- Snapshots se almacenan localmente (no en base de datos distribuida)

## ü§ù Contribuci√≥n

Para contribuir al proyecto:
1. Fork el repositorio
2. Crea una rama para tu feature
3. Implementa tus cambios
4. Agrega pruebas
5. Env√≠a un pull request

## üìÑ Licencia

Este proyecto es parte del curso de Algoritmos y Estructuras de Datos.

---

## üîç M√≥dulo B-Tree: √çndice Persistente de Configuraciones

### Descripci√≥n
Este m√≥dulo implementa un **B-Tree balanceado** como √≠ndice persistente para snapshots de configuraci√≥n y logs. Cada snapshot se guarda como archivo en disco y se indexa en el B-tree para b√∫squedas eficientes.

### Caracter√≠sticas T√©cnicas
- **Orden configurable**: Por defecto orden 4 (m√°ximo 4 hijos por nodo)
- **Claves flexibles**: Soporta strings, timestamps, nombres descriptivos
- **Valores**: Punteros a archivos de configuraci√≥n en disco
- **Operaciones O(log n)**: Inserci√≥n, b√∫squeda y eliminaci√≥n
- **Auto-balance**: Operaciones split/merge autom√°ticas

### Comandos Implementados
```bash
# Guardar snapshots
save running-config          # Guarda configuraci√≥n actual
save snapshot <key>          # Guarda snapshot con clave espec√≠fica

# Cargar snapshots
load config <key>            # Carga configuraci√≥n por clave

# Visualizar informaci√≥n
show snapshots               # Lista todos los snapshots
show btree stats             # Estad√≠sticas del B-tree
```

### Ejemplo de Uso Completo
```
Router1# save snapshot laboratorio
Snapshot 'laboratorio' guardado en snapshots/laboratorio.cfg

Router1# save snapshot backup_2024
Snapshot 'backup_2024' guardado en snapshots/backup_2024.cfg

Router1# show snapshots
laboratorio -> snapshots/laboratorio.cfg
backup_2024 -> snapshots/backup_2024.cfg

Router1# show btree stats
order=4 height=1 nodes=2 splits=0 merges=0

Router1# load config laboratorio
Configuration loaded successfully.
Devices and connections restored.
```

### Estructura de Archivos
```
proyecto2algoritmos/
‚îú‚îÄ‚îÄ snapshots/
‚îÇ   ‚îú‚îÄ‚îÄ laboratorio.cfg
‚îÇ   ‚îú‚îÄ‚îÄ backup_2024.cfg
‚îÇ   ‚îî‚îÄ‚îÄ 2025-08-12T09:30.cfg
‚îî‚îÄ‚îÄ data_structures/
    ‚îî‚îÄ‚îÄ b_tree.py  # Implementaci√≥n del B-tree
```

### Ventajas del Dise√±o
- ‚úÖ **Eficiencia**: B√∫squedas O(log n) incluso con miles de snapshots
- ‚úÖ **Persistencia**: Los archivos se mantienen en disco
- ‚úÖ **Flexibilidad**: Claves pueden ser cualquier string
- ‚úÖ **Escalabilidad**: Maneja grandes vol√∫menes de snapshots
- ‚úÖ **Integridad**: Auto-balance garantiza rendimiento consistente

---

## üîç M√≥dulo Trie: Pol√≠ticas Jer√°rquicas de Prefijos IP

### Descripci√≥n
Este m√≥dulo implementa un **Trie N-ario** para la gesti√≥n eficiente de prefijos IP y pol√≠ticas de red. Cada nodo del trie representa un octeto (0-255) del prefijo IP, permitiendo b√∫squedas de longest-prefix match en O(longitud_prefijo).

### Caracter√≠sticas T√©cnicas
- **Estructura jer√°rquica**: Cada nodo representa un octeto IP (0-255)
- **Longest prefix match**: Encuentra el prefijo m√°s espec√≠fico que coincide
- **Pol√≠ticas heredadas**: Las pol√≠ticas se aplican autom√°ticamente a subprefijos
- **Consulta integrada**: Se ejecuta autom√°ticamente antes del reenv√≠o de paquetes
- **Tipos de pol√≠ticas**: Bloqueo de tr√°fico y l√≠mites de TTL

### Comandos Implementados
```bash
# Configuraci√≥n de pol√≠ticas
policy set <prefix> <mask> ttl-min <N>    # L√≠mite de TTL
policy set <prefix> <mask> block          # Bloquear tr√°fico
policy unset <prefix> <mask>              # Remover pol√≠tica

# Visualizaci√≥n
show ip prefix-tree                       # Estructura jer√°rquica del trie
```

### Aplicaci√≥n Autom√°tica de Pol√≠ticas
```python
# El trie se consulta autom√°ticamente en el proceso de reenv√≠o
def find_route(self, destination_ip):
    # 1. Buscar pol√≠tica en el trie (longest prefix match)
    prefix_match, policy = self.policy_trie.search_longest_prefix(destination_ip)

    # 2. Aplicar pol√≠tica si existe
    if policy and policy.get("block"):
        return None  # Bloquear el paquete

    # 3. Continuar con b√∫squeda en tabla de rutas AVL
    # ... b√∫squeda normal en AVL
```

### Ejemplo de Uso Completo
```
Router1(config)# policy set 192.168.1.0 255.255.255.0 block
Pol√≠tica establecida

Router1(config)# policy set 10.0.0.0 255.255.0.0 ttl-min 5
Pol√≠tica establecida

Router1# show ip prefix-tree
=== TRIE DE PREFIJOS IP ===
192.168.1.0/24 {'block': True}
‚îú‚îÄ‚îÄ 10.0.0.0/16 {'ttl-min': 5}
==============================

Router1# ping 192.168.1.10
Error: No hay ruta disponible (paquete bloqueado por pol√≠tica)
```

### Estructura de Archivos
```
proyecto2algoritmos/
‚îú‚îÄ‚îÄ data_structures/
‚îÇ   ‚îî‚îÄ‚îÄ trie.py              # Implementaci√≥n completa del Trie
‚îî‚îÄ‚îÄ network/
    ‚îî‚îÄ‚îÄ device.py            # Integraci√≥n con policy_trie
```

### Ventajas del Dise√±o
- ‚úÖ **Eficiencia O(W)**: Donde W es la longitud del prefijo (m√°ximo 32 para IPv4)
- ‚úÖ **Longest prefix match**: Encuentra autom√°ticamente el prefijo m√°s espec√≠fico
- ‚úÖ **Herencia autom√°tica**: Pol√≠ticas se aplican a todos los subprefijos
- ‚úÖ **Integraci√≥n transparente**: Funciona autom√°ticamente en el proceso de reenv√≠o
- ‚úÖ **Flexibilidad**: Soporta m√∫ltiples tipos de pol√≠ticas (bloqueo, TTL, QoS)

---

## üîç M√≥dulo B-Tree: √çndice Persistente de Configuraciones

### Descripci√≥n
Este m√≥dulo implementa un **B-Tree balanceado** como √≠ndice persistente para snapshots de configuraci√≥n y logs. Cada snapshot se guarda como archivo en disco y se indexa en el B-tree para b√∫squedas eficientes.

### Caracter√≠sticas T√©cnicas
- **Orden configurable**: Por defecto orden 4 (m√°ximo 4 hijos por nodo)
- **Claves flexibles**: Soporta strings, timestamps, nombres descriptivos
- **Valores**: Punteros a archivos de configuraci√≥n en disco
- **Operaciones O(log n)**: Inserci√≥n, b√∫squeda y eliminaci√≥n
- **Auto-balance**: Operaciones split/merge autom√°ticas

### Comandos Implementados
```bash
# Guardar snapshots
save running-config          # Guarda configuraci√≥n actual
save snapshot <key>          # Guarda snapshot con clave espec√≠fica

# Cargar snapshots
load config <key>            # Carga configuraci√≥n por clave

# Visualizar informaci√≥n
show snapshots               # Lista todos los snapshots
show btree stats             # Estad√≠sticas del B-tree
```

### Ejemplo de Uso Completo
```
Router1# save snapshot laboratorio
Snapshot 'laboratorio' guardado en snapshots/laboratorio.cfg

Router1# save snapshot backup_2024
Snapshot 'backup_2024' guardado en snapshots/backup_2024.cfg

Router1# show snapshots
laboratorio -> snapshots/laboratorio.cfg
backup_2024 -> snapshots/backup_2024.cfg

Router1# show btree stats
order=4 height=1 nodes=2 splits=0 merges=0

Router1# load config laboratorio
Configuration loaded successfully.
Devices and connections restored.
```

### Estructura de Archivos
```
proyecto2algoritmos/
‚îú‚îÄ‚îÄ snapshots/
‚îÇ   ‚îú‚îÄ‚îÄ laboratorio.cfg
‚îÇ   ‚îú‚îÄ‚îÄ backup_2024.cfg
‚îÇ   ‚îî‚îÄ‚îÄ 2025-08-12T09:30.cfg
‚îú‚îÄ‚îÄ data_structures/
‚îÇ   ‚îî‚îÄ‚îÄ b_tree.py  # Implementaci√≥n del B-tree
‚îî‚îÄ‚îÄ network/
    ‚îî‚îÄ‚îÄ network.py # Integraci√≥n con self.snapshots
```

### Ventajas del Dise√±o
- ‚úÖ **Eficiencia**: B√∫squedas O(log n) incluso con miles de snapshots
- ‚úÖ **Persistencia**: Los archivos se mantienen en disco
- ‚úÖ **Flexibilidad**: Claves pueden ser cualquier string
- ‚úÖ **Escalabilidad**: Maneja grandes vol√∫menes de snapshots
- ‚úÖ **Integridad**: Auto-balance garantiza rendimiento consistente

---

## üîç M√≥dulo de Registro de Errores

### Descripci√≥n
Este m√≥dulo implementa un **sistema completo de logging de errores** usando una cola FIFO para almacenar errores en tiempo real durante la ejecuci√≥n del simulador.

### Caracter√≠sticas T√©cnicas
- **Cola FIFO**: Errores se almacenan en orden cronol√≥gico
- **L√≠mite m√°ximo**: 1000 entradas para evitar consumo excesivo de memoria
- **Campos completos**: Timestamp, tipo, severidad, mensaje y comando relacionado
- **Consulta ordenada**: Los errores se muestran en orden de ocurrencia
- **Filtrado opcional**: Posibilidad de limitar n√∫mero de errores mostrados

### Comandos Implementados
```bash
show error-log          # Mostrar todos los errores
show error-log [n]      # Mostrar √∫ltimos n errores
```

### Estructura de la Cola FIFO
```python
class ErrorLogger:
    def __init__(self):
        self.error_queue = Queue()  # Cola FIFO
        self.max_entries = 1000
    
    def log_error(self, error_type, severity, message, command):
        # Enqueue al final de la cola
        error_entry = ErrorEntry(error_type, severity, message, command)
        self.error_queue.enqueue(error_entry)
    
    def get_recent_errors(self, limit=None):
        # Dequeue desde el principio (m√°s antiguos primero)
        # Aplicar l√≠mite si se especifica
        return errors[-limit:] if limit else errors
```

### Flujo de Procesamiento con Logging Completo
```
Paquete llega ‚Üí Procesar en tick()
    ‚Üì
1. Lookup en Trie de pol√≠ticas
   ‚Üí Si bloqueado: Log "PolicyViolation" + descartar
    ‚Üì
2. Si pasa: Lookup en tabla AVL
   ‚Üí Si no hay ruta: Log "NoRouteToHost" + descartar
    ‚Üì
3. Si hay ruta: Validar con tabla ARP
   ‚Üí Si ARP miss: Aprender interfaz
    ‚Üì
4. Enviar paquete: Decrementar TTL
   ‚Üí Si TTL ‚â§ 0: Log "TTLExpired" + descartar
    ‚Üì
5. Comando ejecutado: Registrar errores de sintaxis/permisos
```

### Ejemplo de Uso Completo
```
Router1# policy set 192.168.1.0 255.255.255.0 block
Pol√≠tica establecida

Router1# ping 192.168.1.10
Error: No hay ruta disponible

Router1# show error-log
[2025-01-15 10:30:15] WARNING - PolicyViolation: Paquete bloqueado por pol√≠tica en prefijo 192.168.1.0/24 | Command: packet from 192.168.1.1 to 192.168.1.10
[2025-01-15 10:30:15] ERROR - NoRouteToHost: No hay ruta disponible para 192.168.1.10 | Command: packet from 192.168.1.1

Router1# show error-log 1
[2025-01-15 10:30:15] ERROR - NoRouteToHost: No hay ruta disponible para 192.168.1.10 | Command: packet from 192.168.1.1
```

### Estructura de Archivos
```
proyecto2algoritmos/
‚îú‚îÄ‚îÄ utils/
‚îÇ   ‚îî‚îÄ‚îÄ error_logger.py     # Implementaci√≥n completa del logger
‚îî‚îÄ‚îÄ network/
    ‚îî‚îÄ‚îÄ device.py           # Integraci√≥n en process_queues()
```

### Ventajas del Dise√±o
- ‚úÖ **Tiempo real**: Errores se registran inmediatamente cuando ocurren
- ‚úÖ **Orden cronol√≥gico**: Cola FIFO garantiza orden de llegada
- ‚úÖ **Consulta eficiente**: B√∫squeda r√°pida con l√≠mite opcional
- ‚úÖ **Informaci√≥n completa**: Timestamp, tipo, severidad y contexto
- ‚úÖ **Integraci√≥n completa**: Funciona en todo el flujo de procesamiento
- ‚úÖ **L√≠mite de memoria**: Previene consumo excesivo de recursos

---

## üìñ **Gu√≠a Completa: Comandos B-tree Detallados**

### üîÑ `save snapshot <key>` - Guardar e Indexar Snapshot

**Comando completo:**
```bash
Router1# save snapshot laboratorio
Snapshot 'laboratorio' guardado en snapshots/laboratorio.cfg
```

**¬øQu√© hace internamente?**
1. **Crea archivo de configuraci√≥n**: Genera un archivo `.cfg` completo con:
   - Configuraci√≥n de todos los dispositivos
   - Interfaces y direcciones IP
   - Tabla de rutas completa
   - Pol√≠ticas de red configuradas
   - Conexiones entre dispositivos

2. **Indexa en B-tree**: Agrega entrada al √°rbol balanceado con:
   - **Clave**: El `<key>` proporcionado (ej: "laboratorio")
   - **Valor**: Ruta del archivo (ej: "snapshots/laboratorio.cfg")

3. **Operaci√≥n O(log n)**: La inserci√≥n en el B-tree es eficiente

**Ejemplos de uso:**
```bash
# Nombres descriptivos
Router1# save snapshot config_inicial
Router1# save snapshot backup_seguridad
Router1# save snapshot lab_redes_final

# Con timestamps
Router1# save snapshot 2024-01-15_14:30
Router1# save snapshot backup_pre_examen

# Versionado
Router1# save snapshot v1.0_estable
Router1# save snapshot v1.1_con_rutas
```

### üì• `load config <key>` - Cargar Configuraci√≥n desde B-tree

**Comando completo:**
```bash
Router1# load config laboratorio
Configuration loaded successfully.
Devices and connections restored.
```

**¬øQu√© hace internamente?**
1. **B√∫squeda en B-tree**: Localiza la entrada usando b√∫squeda binaria O(log n)
2. **Lectura del archivo**: Abre y parsea el archivo `.cfg` correspondiente
3. **Restauraci√≥n completa**: Reconstruye el estado del simulador:
   - Vuelve a crear todos los dispositivos
   - Reconfigura interfaces y IPs
   - Restaura tabla de rutas
   - Aplica pol√≠ticas de red
   - Restablece conexiones

**Casos de uso pr√°cticos:**
```bash
# Restaurar configuraci√≥n anterior
Router1# load config config_inicial

# Recuperar de un error
Router1# load config backup_seguridad

# Cambiar entre escenarios de laboratorio
Router1# load config lab_redes_final

# Version control
Router1# load config v1.0_estable
```

### üìã `show snapshots` - Listar Snapshots Ordenados

**Comando completo:**
```bash
Router1# show snapshots
config_inicial -> snapshots/config_inicial.cfg
laboratorio -> snapshots/laboratorio.cfg
v1.0_estable -> snapshots/v1.0_estable.cfg
```

**¬øQu√© hace internamente?**
1. **Recorrido in-order**: Recorre el B-tree en orden alfab√©tico
2. **Formato de salida**: Muestra clave ‚Üí ruta_del_archivo
3. **Vista de solo lectura**: No modifica el estado del simulador
4. **√ötil para recordar**: Ayuda a recordar nombres de snapshots guardados

**Caracter√≠sticas:**
- ‚úÖ **Orden autom√°tico**: Siempre muestra en orden alfab√©tico
- ‚úÖ **Rutas completas**: Incluye la ruta exacta del archivo
- ‚úÖ **Vista r√°pida**: Permite ver todos los snapshots sin cargarlos
- ‚úÖ **No destructivo**: No afecta el estado actual del simulador

### üìä `btree stats` - Estad√≠sticas del √Årbol B

**Comando completo:**
```bash
Router1# show btree stats
order=4 height=2 nodes=8 splits=3 merges=1
```

**¬øQu√© muestra?**
- **`order`**: Orden del B-tree (m√°ximo hijos por nodo)
- **`height`**: Altura actual del √°rbol
- **`nodes`**: N√∫mero total de nodos en el √°rbol
- **`splits`**: Divisiones de nodos realizadas (crecimiento del √°rbol)
- **`merges`**: Fusiones de nodos realizadas (optimizaci√≥n)

**Interpretaci√≥n de m√©tricas:**

```bash
# √Årbol peque√±o y eficiente
order=4 height=1 nodes=3 splits=0 merges=0
# ‚Üí √Årbol nuevo, pocos snapshots, muy eficiente

# √Årbol mediano con crecimiento
order=4 height=2 nodes=12 splits=5 merges=0
# ‚Üí M√°s snapshots, algunas divisiones, buen rendimiento

# √Årbol grande con optimizaciones
order=4 height=3 nodes=25 splits=12 merges=3
# ‚Üí Muchos snapshots, algunas fusiones de optimizaci√≥n
```

### üéØ **Flujo de Trabajo Completo:**

```bash
# 1. Iniciar y configurar
python main.py
Router1> enable
Router1# configure terminal
Router1(config)# ip route add 10.0.0.0 255.255.255.0 via 192.168.1.2
Router1(config)# exit

# 2. Guardar estado inicial
Router1# save snapshot estado_inicial

# 3. Ver qu√© snapshots tenemos
Router1# show snapshots

# 4. Hacer cambios experimentales
Router1# configure terminal
Router1(config)# ip route add 192.168.3.0 255.255.255.0 via 192.168.1.3
Router1(config)# policy set 192.168.1.0 255.255.255.0 block
Router1(config)# exit

# 5. Ver estad√≠sticas del B-tree
Router1# show btree stats

# 6. Guardar estado modificado
Router1# save snapshot estado_modificado

# 7. Ver snapshots disponibles
Router1# show snapshots

# 8. Restaurar estado original si es necesario
Router1# load config estado_inicial
```

### üí° **Consejos Avanzados:**

#### **Estrategias de Nomenclatura:**
```bash
# Por fecha y hora
Router1# save snapshot 2024-01-15_09:00_config_inicial
Router1# save snapshot 2024-01-15_10:30_con_rutas
Router1# save snapshot 2024-01-15_11:00_final

# Por versi√≥n
Router1# save snapshot v1.0_base
Router1# save snapshot v1.1_rutas_agregadas
Router1# save snapshot v1.2_politicas_aplicadas

# Por prop√≥sito
Router1# save snapshot lab1_ejercicio1
Router1# save snapshot lab1_ejercicio2
Router1# save snapshot examen_practico
```

#### **Gesti√≥n de Espacio:**
```bash
# Monitorear crecimiento del √≠ndice
Router1# show btree stats

# Si hay muchos snapshots, considerar limpieza peri√≥dica
# Los archivos .cfg se acumulan en el directorio snapshots/
```

#### **Recuperaci√≥n de Errores:**
```bash
# Si algo sale mal, siempre puedes restaurar
Router1# show snapshots  # Ver qu√© backups tienes
Router1# load config backup_seguridad  # Restaurar estado seguro
```

### üöÄ **Caracter√≠sticas T√©cnicas Avanzadas:**

- **Persistencia**: Los snapshots sobreviven reinicios del simulador
- **Atomicidad**: Las operaciones de guardar/cargar son at√≥micas
- **Consistencia**: El B-tree mantiene siempre su estructura balanceada
- **Escalabilidad**: Funciona eficientemente con cientos de snapshots
- **Integridad**: Verificaci√≥n autom√°tica de archivos de configuraci√≥n

---

## üå≥ **Gu√≠a Completa: Comandos Trie - Pol√≠ticas de Red Jer√°rquicas**

### üéØ `policy set <prefix> <mask> ttl-min <N>` - Establecer TTL M√≠nimo

**Comando completo:**
```bash
Router1(config)# policy set 192.168.1.0 255.255.255.0 ttl-min 64
Pol√≠tica TTL-min aplicada: 192.168.1.0/24 -> TTL >= 64
```

**¬øQu√© hace internamente?**
1. **Valida la red**: Verifica que el prefix/mask formen una red v√°lida
2. **Inserta en Trie**: Agrega la pol√≠tica al √°rbol N-ario por prefijo IP
3. **Aplicaci√≥n jer√°rquica**: Se aplica a todas las IPs que coincidan con el prefijo
4. **Verificaci√≥n de paquetes**: Los paquetes con TTL < N ser√°n descartados

**Ejemplos de uso:**
```bash
# TTL m√≠nimo para red interna
Router1(config)# policy set 192.168.1.0 255.255.255.0 ttl-min 32

# TTL m√≠nimo para subred espec√≠fica
Router1(config)# policy set 10.0.5.0 255.255.255.0 ttl-min 128

# TTL m√≠nimo para red de servidores
Router1(config)# policy set 192.168.100.0 255.255.255.0 ttl-min 64

# TTL m√≠nimo para toda una clase B
Router1(config)# policy set 172.16.0.0 255.255.0.0 ttl-min 16
```

### üö´ `policy set <prefix> <mask> block` - Establecer Pol√≠tica de Bloqueo

**Comando completo:**
```bash
Router1(config)# policy set 10.0.0.0 255.255.0.0 block
Pol√≠tica de bloqueo aplicada: 10.0.0.0/16 -> BLOQUEADO
```

**¬øQu√© hace internamente?**
1. **Bloqueo total**: Cualquier paquete con IP destino en el prefijo ser√° descartado
2. **Prioridad m√°xima**: Las pol√≠ticas de bloqueo tienen prioridad sobre otras pol√≠ticas
3. **Aplicaci√≥n inmediata**: Los paquetes ya en cola ser√°n verificados en el siguiente tick
4. **Logging autom√°tico**: Se registra cada paquete bloqueado en el log de errores

**Ejemplos de uso:**
```bash
# Bloquear red externa sospechosa
Router1(config)# policy set 203.0.113.0 255.255.255.0 block

# Bloquear subred de pruebas
Router1(config)# policy set 192.168.99.0 255.255.255.0 block

# Bloquear acceso a red administrativa desde externa
Router1(config)# policy set 10.0.0.0 255.255.0.0 block

# Bloquear tr√°fico de una red espec√≠fica
Router1(config)# policy set 172.16.5.0 255.255.255.0 block
```

### üóëÔ∏è `policy unset <prefix> <mask>` - Eliminar Pol√≠tica

**Comando completo:**
```bash
Router1(config)# policy unset 192.168.1.0 255.255.255.0
Pol√≠tica eliminada para: 192.168.1.0/24
```

**¬øQu√© hace internamente?**
1. **B√∫squeda exacta**: Localiza el nodo exacto en el Trie
2. **Eliminaci√≥n selectiva**: Solo elimina la pol√≠tica espec√≠fica, no afecta otras
3. **Herencia intacta**: Las pol√≠ticas padre/hijo permanecen activas
4. **Aplicaci√≥n inmediata**: Los cambios se reflejan en el siguiente procesamiento

**Ejemplos de uso:**
```bash
# Eliminar pol√≠tica de TTL espec√≠fica
Router1(config)# policy unset 192.168.1.0 255.255.255.0

# Quitar bloqueo de red
Router1(config)# policy unset 10.0.0.0 255.255.0.0

# Eliminar pol√≠tica de subred
Router1(config)# policy unset 192.168.99.0 255.255.255.0

# Remover restricci√≥n de red externa
Router1(config)# policy unset 203.0.113.0 255.255.255.0
```

### üìä `show ip prefix-tree` - Visualizar √Årbol Trie Completo

**Comando completo:**
```bash
Router1# show ip prefix-tree
Trie de Prefijos IP:
‚îú‚îÄ‚îÄ 0.0.0.0/0 (ra√≠z)
‚îÇ   ‚îú‚îÄ‚îÄ 10.0.0.0/8
‚îÇ   ‚îÇ   ‚îú‚îÄ‚îÄ 10.0.0.0/16 -> BLOQUEADO
‚îÇ   ‚îÇ   ‚îî‚îÄ‚îÄ 10.0.5.0/24 -> TTL >= 128
‚îÇ   ‚îú‚îÄ‚îÄ 172.16.0.0/12
‚îÇ   ‚îÇ   ‚îú‚îÄ‚îÄ 172.16.0.0/16 -> TTL >= 16
‚îÇ   ‚îÇ   ‚îî‚îÄ‚îÄ 172.16.5.0/24 -> BLOQUEADO
‚îÇ   ‚îî‚îÄ‚îÄ 192.168.0.0/16
‚îÇ       ‚îú‚îÄ‚îÄ 192.168.1.0/24 -> TTL >= 32
‚îÇ       ‚îú‚îÄ‚îÄ 192.168.100.0/24 -> TTL >= 64
‚îÇ       ‚îî‚îÄ‚îÄ 192.168.99.0/24 -> BLOQUEADO
```

**¬øQu√© muestra?**
- **Estructura jer√°rquica**: Representaci√≥n visual del √°rbol N-ario
- **Prefijos activos**: Todas las redes con pol√≠ticas configuradas
- **Tipo de pol√≠tica**: TTL-min o bloqueo para cada prefijo
- **M√°scara de red**: Longitud del prefijo (/8, /16, /24, etc.)
- **Herencia visual**: Relaciones padre-hijo claramente mostradas

### üîç **Funcionamiento Interno del Trie:**

#### **Estructura del √Årbol N-ario:**
```
Ra√≠z (0.0.0.0/0)
‚îú‚îÄ‚îÄ 10.*.*.* (10.0.0.0/8)
‚îÇ   ‚îú‚îÄ‚îÄ 10.0.*.* (10.0.0.0/16) -> BLOQUEADO
‚îÇ   ‚îî‚îÄ‚îÄ 10.0.5.* (10.0.5.0/24) -> TTL >= 128
‚îú‚îÄ‚îÄ 172.16.*.* (172.16.0.0/12)
‚îÇ   ‚îú‚îÄ‚îÄ 172.16.*.* (172.16.0.0/16) -> TTL >= 16
‚îÇ   ‚îî‚îÄ‚îÄ 172.16.5.* (172.16.5.0/24) -> BLOQUEADO
‚îî‚îÄ‚îÄ 192.168.*.* (192.168.0.0/16)
    ‚îú‚îÄ‚îÄ 192.168.1.* (192.168.1.0/24) -> TTL >= 32
    ‚îú‚îÄ‚îÄ 192.168.100.* (192.168.100.0/24) -> TTL >= 64
    ‚îî‚îÄ‚îÄ 192.168.99.* (192.168.99.0/24) -> BLOQUEADO
```

#### **Algoritmo de B√∫squeda (Longest Prefix Match):**
```python
def buscar_politica(ip_destino):
    # 1. Convertir IP a binario
    # 2. Recorrer Trie desde la ra√≠z
    # 3. Tomar el camino m√°s largo que coincida
    # 4. Aplicar pol√≠tica encontrada (o ninguna si no hay match)
    return politica_encontrada
```

### üéØ **Flujo de Trabajo Completo con Pol√≠ticas:**

```bash
# 1. Iniciar y configurar red b√°sica
python main.py
Router1> enable
Router1# configure terminal

# 2. Establecer pol√≠ticas de seguridad
Router1(config)# policy set 10.0.0.0 255.0.0.0 block          # Bloquear clase A privada externa
Router1(config)# policy set 192.168.0.0 255.255.0.0 ttl-min 32 # TTL m√≠nimo para redes privadas
Router1(config)# policy set 172.16.0.0 255.240.0.0 ttl-min 16  # TTL m√≠nimo para DMZ

# 3. Configurar rutas
Router1(config)# ip route add 10.0.0.0 255.0.0.0 via 192.168.1.2
Router1(config)# ip route add 172.16.0.0 255.240.0.0 via 192.168.1.3
Router1(config)# exit

# 4. Ver estructura del Trie
Router1# show ip prefix-tree

# 5. Probar pol√≠ticas con paquetes
Router1# ping 10.0.5.10      # Deber√≠a ser bloqueado
Router1# ping 192.168.1.50   # Deber√≠a requerir TTL >= 32
Router1# ping 172.16.5.100   # Deber√≠a requerir TTL >= 16

# 6. Ajustar pol√≠ticas seg√∫n necesidad
Router1# configure terminal
Router1(config)# policy set 10.0.5.0 255.255.255.0 ttl-min 128   # Excepci√≥n espec√≠fica
Router1(config)# policy unset 192.168.0.0 255.255.0.0            # Remover pol√≠tica amplia
Router1(config)# policy set 192.168.1.0 255.255.255.0 ttl-min 64 # Pol√≠tica m√°s espec√≠fica
Router1(config)# exit

# 7. Verificar cambios
Router1# show ip prefix-tree
```

### üí° **Consejos Avanzados para Pol√≠ticas:**

#### **Estrategias de Prefijos:**
```bash
# Pol√≠ticas amplias (menos espec√≠ficas)
Router1(config)# policy set 192.168.0.0 255.255.0.0 ttl-min 32   # Toda 192.168.0.0/16
Router1(config)# policy set 10.0.0.0 255.0.0.0 block             # Toda clase A

# Pol√≠ticas espec√≠ficas (m√°s prioritarias)
Router1(config)# policy set 192.168.1.0 255.255.255.0 ttl-min 64  # Solo subred espec√≠fica
Router1(config)# policy set 10.0.5.0 255.255.255.0 block          # Solo subred espec√≠fica

# Excepciones mediante especificidad
Router1(config)# policy set 192.168.0.0 255.255.0.0 block         # Bloquear toda la red
Router1(config)# policy set 192.168.1.0 255.255.255.0 ttl-min 64  # Excepci√≥n para subred
```

#### **Gesti√≥n de Conflicto de Pol√≠ticas:**
```bash
# El Trie resuelve conflictos autom√°ticamente:
# - Pol√≠ticas m√°s espec√≠ficas tienen prioridad
# - Longest Prefix Match determina qu√© pol√≠tica aplicar
# - Bloqueo tiene prioridad sobre TTL-min
```

#### **Monitoreo de Pol√≠ticas:**
```bash
# Ver todas las pol√≠ticas activas
Router1# show ip prefix-tree

# Ver logs de aplicaci√≥n de pol√≠ticas
Router1# show error-log

# Ver estad√≠sticas de aplicaci√≥n
Router1# show statistics
```

### üöÄ **Caracter√≠sticas T√©cnicas Avanzadas:**

#### **Eficiencia del Trie:**
- **Longest Prefix Match O(W)**: Donde W es la longitud de la IP (32 bits)
- **Memoria optimizada**: Solo almacena nodos con pol√≠ticas
- **B√∫squeda r√°pida**: Comparaci√≥n bit a bit, no conversi√≥n de strings
- **Escalabilidad**: Maneja miles de prefijos eficientemente

#### **Jerarqu√≠a y Herencia:**
```python
# Ejemplo de jerarqu√≠a:
# 192.168.0.0/16 (pol√≠tica general)
# ‚îú‚îÄ‚îÄ 192.168.1.0/24 (pol√≠tica espec√≠fica - tiene prioridad)
# ‚îú‚îÄ‚îÄ 192.168.2.0/24 (hereda de /16)
# ‚îî‚îÄ‚îÄ 192.168.100.0/24 (pol√≠tica espec√≠fica diferente)
```

#### **Integraci√≥n con el Sistema:**
- **Procesamiento de paquetes**: Pol√≠ticas se verifican en cada tick
- **Logging autom√°tico**: Cada aplicaci√≥n de pol√≠tica se registra
- **Interfaz unificada**: Funciona con todos los tipos de dispositivo
- **Persistencia**: Pol√≠ticas se guardan en snapshots del B-tree

### ‚ö†Ô∏è **Consideraciones Importantes:**

#### **Orden de Verificaci√≥n:**
1. **Pol√≠tica de bloqueo**: Si encuentra bloqueo, descarta inmediatamente
2. **Pol√≠tica TTL-min**: Si encuentra TTL insuficiente, descarta
3. **Tabla de rutas**: Si pasa pol√≠ticas, contin√∫a con enrutamiento normal
4. **ARP/Encaminamiento**: Procesamiento normal si todo OK

#### **Casos Especiales:**
```bash
# Pol√≠tica por defecto (0.0.0.0/0)
Router1(config)# policy set 0.0.0.0 0.0.0.0 ttl-min 1  # TTL m√≠nimo global

# Pol√≠ticas superpuestas
Router1(config)# policy set 192.168.0.0 255.255.0.0 block        # Bloquear /16
Router1(config)# policy set 192.168.1.0 255.255.255.0 ttl-min 64 # Excepci√≥n /24

# Resultado: 192.168.1.0/24 tiene TTL-min, resto de 192.168.0.0/16 bloqueado
```

---

## üìù **Sistema de Registro de Errores - Error Logging**

### üéØ `show error-log` - Mostrar Todos los Errores

**Comando completo:**
```bash
Router1# show error-log
[2024-01-15 14:30:25] ERROR - PolicyViolation: Paquete bloqueado por pol√≠tica de red
  Destino: 10.0.5.10, Origen: 192.168.1.100
  Comando: ping 10.0.5.10, Pol√≠tica: 10.0.0.0/16 bloqueada

[2024-01-15 14:30:30] ERROR - TTLExpired: Paquete descartado por TTL insuficiente
  Destino: 192.168.2.50, Origen: 192.168.1.100
  Comando: ping 192.168.2.50, TTL: 0

[2024-01-15 14:30:35] ERROR - NoRouteToHost: No se encontr√≥ ruta para el destino
  Destino: 203.0.113.5, Origen: 192.168.1.100
  Comando: ping 203.0.113.5
```

### üìä `show error-log [n]` - Mostrar √öltimos N Errores

**Comando completo:**
```bash
Router1# show error-log 3
Mostrando los √∫ltimos 3 errores:

[2024-01-15 14:35:20] ERROR - PolicyViolation: Paquete bloqueado por pol√≠tica TTL
  Destino: 172.16.5.25, Origen: 192.168.1.100
  Comando: ping 172.16.5.25, TTL requerido: 32, TTL actual: 30

[2024-01-15 14:35:25] ERROR - InterfaceError: Error en interfaz de salida
  Destino: 10.0.0.5, Origen: 192.168.1.100
  Comando: ping 10.0.0.5, Interfaz: eth0, Estado: down

[2024-01-15 14:35:30] WARNING - ARPTimeout: Timeout en resoluci√≥n ARP
  Destino: 192.168.1.200, Origen: 192.168.1.100
  Comando: ping 192.168.1.200, Intentos: 3
```

**¬øQu√© muestra cada entrada?**
- **Timestamp**: Fecha y hora exacta del evento
- **Severidad**: ERROR, WARNING, INFO, DEBUG
- **Tipo**: Categor√≠a espec√≠fica del error
- **Mensaje**: Descripci√≥n detallada del problema
- **Contexto**: Informaci√≥n adicional (IPs, comandos, valores, etc.)

### üîç **Funcionamiento Interno del Sistema de Logging:**

#### **Estructura de una Entrada de Log:**
```python
class ErrorEntry:
    def __init__(self, timestamp, error_type, severity, message, command=None, context=None):
        self.timestamp = timestamp          # Fecha y hora del evento
        self.error_type = error_type        # Tipo de error (PolicyViolation, TTLExpired, etc.)
        self.severity = severity           # Severidad (ERROR, WARNING, INFO, DEBUG)
        self.message = message            # Mensaje descriptivo
        self.command = command            # Comando que caus√≥ el error (opcional)
        self.context = context            # Informaci√≥n adicional (opcional)
```

#### **Implementaci√≥n con Queue (FIFO):**
```python
class ErrorLogger:
    def __init__(self, max_size=1000):
        self.log_queue = Queue()          # Cola FIFO para logs
        self.max_size = max_size          # Tama√±o m√°ximo de la cola

    def log_error(self, error_type, message, command=None, context=None):
        # Crear entrada de log
        entry = ErrorEntry(
            timestamp=datetime.now(),
            error_type=error_type,
            severity=self._get_severity(error_type),
            message=message,
            command=command,
            context=context
        )

        # Agregar a la cola
        self.log_queue.enqueue(entry)

        # Mantener tama√±o m√°ximo (eliminar m√°s antiguos si es necesario)
        if self.log_queue.size() > self.max_size:
            self.log_queue.dequeue()
```

### üìã **Tipos de Errores Disponibles:**

#### **1. üö´ PolicyViolation - Violaci√≥n de Pol√≠ticas**
```bash
# Ocurre cuando un paquete viola una pol√≠tica de red
Ejemplos:
- Paquete bloqueado por pol√≠tica de red
- TTL insuficiente para pol√≠tica aplicada
- Acceso denegado por regla de firewall
```

#### **2. ‚è∞ TTLExpired - TTL Agotado**
```bash
# Ocurre cuando un paquete llega con TTL = 0 o insuficiente
Ejemplos:
- Paquete descartado por TTL insuficiente
- TTL m√≠nimo requerido por pol√≠tica no cumplido
- Bucle de enrutamiento detectado
```

#### **3. üõ£Ô∏è NoRouteToHost - Sin Ruta Disponible**
```bash
# Ocurre cuando no se encuentra ruta para el destino
Ejemplos:
- No se encontr√≥ ruta en tabla de enrutamiento
- Red destino no alcanzable
- Ruta por defecto no configurada
```

#### **4. üîå InterfaceError - Error de Interfaz**
```bash
# Ocurre cuando hay problemas con interfaces de red
Ejemplos:
- Interfaz en estado 'down'
- Error en configuraci√≥n de IP
- Problema en conexi√≥n f√≠sica
```

#### **5. üì° ARPTimeout - Timeout en ARP**
```bash
# Ocurre cuando falla la resoluci√≥n de direcciones MAC
Ejemplos:
- Timeout en consulta ARP
- Direcci√≥n IP no encontrada en red local
- Problema en tabla ARP
```

#### **6. ‚öôÔ∏è CommandError - Error de Comando**
```bash
# Ocurre cuando hay errores en comandos CLI
Ejemplos:
- Comando desconocido
- Sintaxis incorrecta
- Par√°metros inv√°lidos
- Permisos insuficientes
```

#### **7. üîÑ NetworkError - Error de Red General**
```bash
# Ocurre en errores generales de red
Ejemplos:
- Problema de conectividad
- Error en procesamiento de paquetes
- Problema en configuraci√≥n de red
```

### üéØ **Flujo de Procesamiento con Logging:**

#### **Procesamiento de Paquetes con Logging Integrado:**
```python
def process_packet(self, packet):
    try:
        # 1. Verificar pol√≠ticas (Trie)
        prefix_match, policy = self.policy_trie.search_longest_prefix(packet.destination_ip)

        if policy:
            if policy.get('block'):
                self.error_logger.log_error(
                    'PolicyViolation',
                    f'Paquete bloqueado por pol√≠tica de red',
                    context={
                        'source': packet.source_ip,
                        'destination': packet.destination_ip,
                        'policy': f"{prefix_match} bloqueada"
                    }
                )
                return  # Descartar paquete

            if policy.get('ttl_min') and packet.ttl < policy['ttl_min']:
                self.error_logger.log_error(
                    'TTLExpired',
                    f'TTL insuficiente para pol√≠tica aplicada',
                    context={
                        'source': packet.source_ip,
                        'destination': packet.destination_ip,
                        'ttl_required': policy['ttl_min'],
                        'ttl_actual': packet.ttl
                    }
                )
                return  # Descartar paquete

        # 2. Buscar ruta (AVL Tree)
        route = self.routing_table.search_key(packet.destination_ip)
        if not route:
            self.error_logger.log_error(
                'NoRouteToHost',
                f'No se encontr√≥ ruta para el destino',
                context={
                    'source': packet.source_ip,
                    'destination': packet.destination_ip
                }
            )
            return  # Descartar paquete

        # 3. Verificar interfaz de salida
        output_interface = self.interfaces.get(route.next_hop)
        if not output_interface or not output_interface.status == 'up':
            self.error_logger.log_error(
                'InterfaceError',
                f'Error en interfaz de salida',
                context={
                    'source': packet.source_ip,
                    'destination': packet.destination_ip,
                    'interface': output_interface.name if output_interface else 'unknown',
                    'status': output_interface.status if output_interface else 'not found'
                }
            )
            return  # Descartar paquete

        # 4. Procesar ARP si es necesario
        if not self.arp_table.get(packet.destination_ip):
            arp_success = self._resolve_arp(packet.destination_ip)
            if not arp_success:
                self.error_logger.log_error(
                    'ARPTimeout',
                    f'Timeout en resoluci√≥n ARP',
                    context={
                        'source': packet.source_ip,
                        'destination': packet.destination_ip,
                        'attempts': 3
                    }
                )
                return  # Descartar paquete

        # 5. Decrementar TTL y enviar
        packet.ttl -= 1
        if packet.ttl <= 0:
            self.error_logger.log_error(
                'TTLExpired',
                f'Paquete descartado por TTL agotado',
                context={
                    'source': packet.source_ip,
                    'destination': packet.destination_ip,
                    'final_ttl': packet.ttl
                }
            )
            return  # Descartar paquete

        # Paquete enviado exitosamente
        self._send_packet(packet, output_interface)

    except Exception as e:
        self.error_logger.log_error(
            'NetworkError',
            f'Error general en procesamiento de paquete: {str(e)}',
            context={
                'source': packet.source_ip,
                'destination': packet.destination_ip,
                'exception': str(e)
            }
        )
```

### üìà **Estad√≠sticas y Monitoreo de Errores:**

#### **Comando Adicional: `show error-counts`**
```bash
Router1# show error-counts
Estad√≠sticas de Errores (√∫ltimas 24 horas):

PolicyViolation: 15 (42%)
TTLExpired: 8 (22%)
NoRouteToHost: 5 (14%)
InterfaceError: 3 (8%)
ARPTimeout: 3 (8%)
CommandError: 2 (6%)

Total de errores: 36
Promedio por hora: 1.5
```

### üéØ **Flujo de Trabajo Completo con Logging:**

```bash
# 1. Iniciar simulador y configurar red
python main.py
Router1> enable
Router1# configure terminal

# 2. Configurar pol√≠ticas que generar√°n logs
Router1(config)# policy set 10.0.0.0 255.0.0.0 block
Router1(config)# policy set 192.168.0.0 255.255.0.0 ttl-min 32
Router1(config)# exit

# 3. Generar algunos errores para ver logs
Router1# ping 10.0.5.10      # Generar√° PolicyViolation
Router1# ping 192.168.2.50   # Generar√° TTLExpired (si TTL < 32)
Router1# ping 203.0.113.5    # Generar√° NoRouteToHost

# 4. Ver todos los errores
Router1# show error-log

# 5. Ver solo los √∫ltimos 5 errores
Router1# show error-log 5

# 6. Ver estad√≠sticas de errores
Router1# show error-counts

# 7. Limpiar logs si es necesario (comando hipot√©tico)
Router1# clear error-log
```

### üí° **Consejos para Uso del Sistema de Logging:**

#### **Interpretaci√≥n de Logs:**
```bash
# PolicyViolation frecuente -> Revisar pol√≠ticas de seguridad
# TTLExpired frecuente -> Problemas de enrutamiento o bucles
# NoRouteToHost frecuente -> Falta configuraci√≥n de rutas
# InterfaceError frecuente -> Problemas de conectividad f√≠sica
# ARPTimeout frecuente -> Problemas en red local
```

#### **Diagn√≥stico de Problemas:**
```bash
# 1. Ver logs recientes
Router1# show error-log 10

# 2. Identificar patr√≥n de errores
# 3. Revisar configuraci√≥n seg√∫n el tipo de error
# 4. Corregir configuraci√≥n
# 5. Verificar que los errores disminuyan
```

#### **Mantenimiento de Logs:**
- **Rotaci√≥n autom√°tica**: Los logs m√°s antiguos se eliminan autom√°ticamente
- **L√≠mite de memoria**: M√°ximo 1000 entradas por defecto
- **Persistencia**: Los logs se pierden al reiniciar (por dise√±o)
- **Filtrado**: Se pueden mostrar solo los m√°s recientes con `[n]`

### üöÄ **Caracter√≠sticas T√©cnicas Avanzadas:**

#### **Eficiencia del Sistema:**
- **Queue FIFO**: Estructura O(1) para inserci√≥n y eliminaci√≥n
- **Memoria limitada**: Previene consumo excesivo de recursos
- **Thread-safe**: Funciona correctamente en entornos multi-hilo
- **Timestamp preciso**: Registra microsegundos para orden correcto

#### **Integraci√≥n Completa:**
- **Con pol√≠ticas Trie**: Logs cuando se violan pol√≠ticas
- **Con tabla AVL**: Logs cuando no se encuentra ruta
- **Con procesamiento de paquetes**: Logs en cada paso cr√≠tico
- **Con CLI**: Logs de errores de comandos
- **Con snapshots**: Logs se incluyen en backups

#### **Severidades Disponibles:**
- **ERROR**: Problemas cr√≠ticos que impiden funcionamiento
- **WARNING**: Problemas que requieren atenci√≥n pero no cr√≠ticos
- **INFO**: Informaci√≥n √∫til sobre operaciones normales
- **DEBUG**: Detalles t√©cnicos para troubleshooting avanzado

### ‚ö†Ô∏è **Consideraciones Importantes:**

#### **L√≠mite de Memoria:**
```python
# Por defecto: m√°ximo 1000 entradas
# Los logs m√°s antiguos se eliminan autom√°ticamente
# Se puede configurar en el constructor de ErrorLogger
```

#### **Persistencia:**
```python
# Los logs NO se guardan en snapshots
# Se pierden al reiniciar el simulador
# Esto es por dise√±o para evitar archivos de log muy grandes
```

#### **Rendimiento:**
```python
# Operaciones O(1) para logging
# No afecta rendimiento del procesamiento de paquetes
# Logging as√≠ncrono (no bloquea procesamiento principal)
```

---

**Desarrollado con ‚ù§Ô∏è para el aprendizaje de algoritmos y redes de computadoras**
